/*3. Ежемесячная стипендия студента составляет N гривен, а расходы на проживание 
превышают стипендию и составляют M гривен в месяц. Рост цен ежемесячно 
увеличивает расходы на 3%. Составьте программу расчёта суммы денег, которую 
необходимо единовременно попросить у родителей, чтобы можно было прожить 
учебный год (10 месяцев), используя только эти деньги и стипендию.*/
package dz2_1;

public class dz03 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
